In [1]:
import pandas as pd

In [2]:
df1 = pd.read_csv("searchword.csv")
df2 = pd.read_csv("usedata.csv")

c:\Users\mkh08\miniconda3\envs\py3.10\lib\site-packages\IPython\core\interactiveshell.py:3505: DtypeWarning: Columns (11,14) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

In [15]:
df3 = pd.read_csv("Details2.csv")

c:\Users\mkh08\miniconda3\envs\py3.10\lib\site-packages\IPython\core\interactiveshell.py:3505: DtypeWarning: Columns (11,14) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

In [3]:
df1.head()

,Unnamed: 0,ISBN_NO,Combined
0,0,1111111111111,영어학습
1,1,2090000056501,"매일, 고전, 하이쿠, 삼국유사, 동양고전, 하루, 열하일기, 논어, 민음사편집부,..."
2,2,2090000063035,"편리, 이미지, 일력, 쓰기, 옛글, 느낌, 문장, 하이쿠, 논어, 차고, 사용, ..."
3,3,8801748054605,"밤하늘, 여전, 사진, 밑그림, 비행접시, 자신, 부록, 사이, 반짝, 우주, 바탕..."
4,4,8803581200010,"다양, 새해인사, 포토북, 기념일, 문장, 특전, 인증카드, 날짜, 시집, 스티커,..."

In [39]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 735962 entries, 0 to 735961
Data columns (total 2 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   ISBN_NO  735962 non-null  int64
 1   LON_CO   735962 non-null  int64
dtypes: int64(2)
memory usage: 11.2 MB

In [25]:
df2 = df2[['ISBN_NO','LON_CO']]

In [31]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 735962 entries, 0 to 735961
Data columns (total 2 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   ISBN_NO  735962 non-null  int64
 1   LON_CO   735962 non-null  int64
dtypes: int64(2)
memory usage: 11.2 MB

In [19]:
df3 = df3.dropna(subset=['KDC_NM'])

In [27]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 592203 entries, 0 to 1103282
Data columns (total 15 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   BOOK_MASTR_SEQ_NO     592203 non-null  int64
 1   ISBN_NO               592203 non-null  int64
 2   MUMM_LON_HALFLIFE_CO  592203 non-null  int64
 3   MXMM_LON_HALFLIFE_CO  592203 non-null  int64
 4   AVRG_LON_HALFLIFE_CO  592203 non-null  int64
 5   BOOK_CO               592203 non-null  int64
 6   ISBN_THIRTEEN_NO      592203 non-null  float64
 7   TITLE_NM              592203 non-null  object
 8   AUTHR_NM              589566 non-null  object
 9   PUBLISHER_NM          544871 non-null  object
 10  SEQ_NO                592203 non-null  float64
 11  ADTION_SMBL_NM        547708 non-null  object
 12  IMAGE_URL             458021 non-null  object
 13  BOOK_INTRCN_CN        441178 non-null  object
 14  KDC_NM                592203 non-null  object
dtypes: float64(2), int64(6), object(7)
memory usage: 72.3+ MB

In [33]:
df4 = pd.merge(df3, df2, on="ISBN_NO", how='inner')

In [34]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 531802 entries, 0 to 531801
Data columns (total 16 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   BOOK_MASTR_SEQ_NO     531802 non-null  int64
 1   ISBN_NO               531802 non-null  int64
 2   MUMM_LON_HALFLIFE_CO  531802 non-null  int64
 3   MXMM_LON_HALFLIFE_CO  531802 non-null  int64
 4   AVRG_LON_HALFLIFE_CO  531802 non-null  int64
 5   BOOK_CO               531802 non-null  int64
 6   ISBN_THIRTEEN_NO      531802 non-null  float64
 7   TITLE_NM              531802 non-null  object
 8   AUTHR_NM              531774 non-null  object
 9   PUBLISHER_NM          528668 non-null  object
 10  SEQ_NO                531802 non-null  float64
 11  ADTION_SMBL_NM        521645 non-null  object
 12  IMAGE_URL             448132 non-null  object
 13  BOOK_INTRCN_CN        435702 non-null  object
 14  KDC_NM                531802 non-null  object
 15  LON_CO                531802 non-null  int64
dtypes: float64(2), int64(7), object(7)
memory usage: 69.0+ MB

In [42]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 128584 entries, 0 to 128583
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   ISBN_NO   128584 non-null  object
 1   Combined  128584 non-null  object
dtypes: object(2)
memory usage: 2.0+ MB

In [36]:
df1.drop('Unnamed: 0', axis=1, inplace=True)

In [43]:
df4['ISBN_NO']= df4['ISBN_NO'].astype(str)

In [44]:
df = pd.merge(df4, df1, on="ISBN_NO", how="left")

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 532952 entries, 0 to 532951
Data columns (total 17 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   BOOK_MASTR_SEQ_NO     532952 non-null  int64
 1   ISBN_NO               532952 non-null  object
 2   MUMM_LON_HALFLIFE_CO  532952 non-null  int64
 3   MXMM_LON_HALFLIFE_CO  532952 non-null  int64
 4   AVRG_LON_HALFLIFE_CO  532952 non-null  int64
 5   BOOK_CO               532952 non-null  int64
 6   ISBN_THIRTEEN_NO      532952 non-null  float64
 7   TITLE_NM              532952 non-null  object
 8   AUTHR_NM              532924 non-null  object
 9   PUBLISHER_NM          529818 non-null  object
 10  SEQ_NO                532952 non-null  float64
 11  ADTION_SMBL_NM        522791 non-null  object
 12  IMAGE_URL             449282 non-null  object
 13  BOOK_INTRCN_CN        436845 non-null  object
 14  KDC_NM                532952 non-null  object
 15  LON_CO                532952 non-null  int64
 16  Combined              76835 non-null   object
dtypes: float64(2), int64(6), object(9)
memory usage: 73.2+ MB